# 리눅스와 node.js 가 함께 설치되어 있는 이미지. 
# nodejs 버전과 일치하는 숫자를 선택, 용량이 적은 slim 버전을 선택
# windows 이미지 설치해도 되지만 리눅스가 서버비가 보통 덜 들기 때문에 선택
FROM node:22-slim 

# /app 폴더로 이동 (cd 명령어랑 비슷함)
# 만약 없으면 하나 생성해 줌
# 이미지 기본 경로에 파일을 옮기면 좀 더러워지니까 /app 이라는 폴더를 하나 만들어서 깔끔하게 거기에 정리
WORKDIR /app

# 내 컴퓨터 폴더 경로 / 이미지를 어디로 옮길건지
# . 은 현재 경로라는 뜻
# 근데 필요없는 애들도 복사돼버리기 때문에 .dockerignore 로 관리
COPY . .

# 라이브러리 설치
RUN ["npm", "install"]

# 어떤 포트를 열어서 사용할 지
# 근데 나중에 이미지 실행할 때 힌트제공용, 그냥 메모용임, 기능상 아무 의미 없음
EXPOSE 8080

# 마지막 터미널 명령어는 RUN 말고 CMD 로 작성 (혹은 ENTRYPOINT)
CMD ["node", "server.js"]